---
kind: type
id: T:Autodesk.Revit.DB.DoubleArray
source: html/affa884a-e272-c81a-1fb6-7325edc4f620.htm
---
# Autodesk.Revit.DB.DoubleArray

An array that contains doubles.

## Syntax (C#)
```csharp
public class DoubleArray : APIObject,
	IEnumerable
```